<!-- dflook/terraform-github-actions {"workspace":"destroy","backend_type":"remote","plan_modifier":"3ff51ef2952dcba08afacf265525a232d4df9d84d2e4e51b8ad8dc55269460d1","backend":"a462bb8871508068888b2b3aac1422eb3920cc9f7190e0e41ef386de75f1d46e","plan_job_ref":"Job Test plan target and replace #319 at https://github.com/dflook/terraform-github-actions/actions/runs/4293606072","plan_hash":"117e31e035b32dbee49b158a3d2bedb494c71a8409fe56b2c3c1c0365ea28460","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __destroy__ workspace
:skull: Planning to destroy all resources
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be created
  + resource "random_string" "foreach" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + foreach = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #319](https://github.com/dflook/terraform-github-actions/actions/runs/4293606072)